// BlueprintGeneratedClass BP_CollectorsChest_Wieldable.BP_CollectorsChest_Wieldable_C
// Size: 0x8a8 (Inherited: 0x840)
struct ABP_CollectorsChest_Wieldable_C : ACollectorsChestStaticWieldableItem {
	struct UMaterialManipulationComponent* MaterialManipulation; // 0x840(0x08)
	struct UOpenableItemMaterialAnimationReactionComponent* OpenableItemMaterialAnimationReaction; // 0x848(0x08)
	struct UMaterialAnimatorComponent* MaterialAnimator; // 0x850(0x08)
	struct UBoxComponent* HitVolume; // 0x858(0x08)
	struct UAnimNotifyWwiseEmitterComponent* AnimNotifyWwiseEmitter; // 0x860(0x08)
	struct UGoldInContainerComponent* GoldInContainer; // 0x868(0x08)
	struct UQuestBookPagesInContainerComponent* QuestBookPagesInContainer; // 0x870(0x08)
	struct UCollectorsChestItemSlotInteractable* ItemSlotInteractable_1; // 0x878(0x08)
	struct UCollectorsChestItemSlotInteractable* ItemSlotInteractable_3; // 0x880(0x08)
	struct UCollectorsChestItemSlotInteractable* ItemSlotInteractable_2; // 0x888(0x08)
	struct UPickupableComponent* Pickupable; // 0x890(0x08)
	struct UUsableWieldableComponent* UsableWieldable; // 0x898(0x08)
	struct UWieldableInteractableComponent* WieldableInteractable; // 0x8a0(0x08)

	void UserConstructionScript(); // Function BP_CollectorsChest_Wieldable.BP_CollectorsChest_Wieldable_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1870810
};

