// BlueprintGeneratedClass BP_ghostship_candle_01_a_movable.BP_ghostship_candle_01_a_movable_C
// Size: 0x438 (Inherited: 0x3c8)
struct ABP_ghostship_candle_01_a_movable_C : AActor {
	struct UStaticMeshComponent* StaticMesh1; // 0x3c8(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x3d8(0x08)
	struct UParticleSystemComponent* vfx_tavern_candle_looping_014; // 0x3e0(0x08)
	struct UParticleSystemComponent* vfx_tavern_candle_looping_013; // 0x3e8(0x08)
	struct UParticleSystemComponent* vfx_tavern_candle_looping_012; // 0x3f0(0x08)
	struct UParticleSystemComponent* vfx_tavern_candle_looping_011; // 0x3f8(0x08)
	struct UParticleSystemComponent* vfx_tavern_candle_looping_01; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x428(0x08)
	struct USceneComponent* SharedRoot; // 0x430(0x08)

	void UserConstructionScript(); // Function BP_ghostship_candle_01_a_movable.BP_ghostship_candle_01_a_movable_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

