// BlueprintGeneratedClass BP_GH_GoldenSands_Sovereign_AudioLayer.BP_GH_GoldenSands_Sovereign_AudioLayer_C
// Size: 0x410 (Inherited: 0x3c8)
struct ABP_GH_GoldenSands_Sovereign_AudioLayer_C : AActor {
	struct UTritonComponent* Triton; // 0x3c8(0x08)
	struct UAudioPortalComponent* AudioPortal_06; // 0x3d0(0x08)
	struct UAudioPortalComponent* AudioPortal_05; // 0x3d8(0x08)
	struct UAudioPortalComponent* AudioPortal_04; // 0x3e0(0x08)
	struct UAudioPortalComponent* AudioPortal_03; // 0x3e8(0x08)
	struct UAudioPortalComponent* AudioPortal_02; // 0x3f0(0x08)
	struct UAudioPortalComponent* AudioPortal_01; // 0x3f8(0x08)
	struct UAudioSpaceComponent* AudioSpace; // 0x400(0x08)
	struct USceneComponent* Scene; // 0x408(0x08)

	void UserConstructionScript(); // Function BP_GH_GoldenSands_Sovereign_AudioLayer.BP_GH_GoldenSands_Sovereign_AudioLayer_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

