// BlueprintGeneratedClass BP_LargeShip_QuestTable.BP_LargeShip_QuestTable_C
// Size: 0x948 (Inherited: 0x8f0)
struct ABP_LargeShip_QuestTable_C : AVoyageTable {
	struct UChildActorComponent* CancelVoyageSeaOfThievesOnDemand; // 0x8f0(0x08)
	struct UChildActorComponent* WarMap; // 0x8f8(0x08)
	struct UChildActorComponent* FactionHourglass; // 0x900(0x08)
	struct UChildActorComponent* CancelAdventure; // 0x908(0x08)
	struct UChildActorComponent* PlayerBuiredItemsMapBundleInteractionPoint; // 0x910(0x08)
	struct UChildActorComponent* CancelTale; // 0x918(0x08)
	struct UChildActorComponent* CancelVoyage; // 0x920(0x08)
	struct UChildActorComponent* VoyageSelectionSlot4; // 0x928(0x08)
	struct UChildActorComponent* VoyageSelectionSlot3; // 0x930(0x08)
	struct UChildActorComponent* VoyageSelectionSlot2; // 0x938(0x08)
	struct UChildActorComponent* VoyageSelectionSlot1; // 0x940(0x08)

	void UserConstructionScript(); // Function BP_LargeShip_QuestTable.BP_LargeShip_QuestTable_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

