// BlueprintGeneratedClass BP_MerchantCrate_Static_Wieldable.BP_MerchantCrate_Static_Wieldable_C
// Size: 0x880 (Inherited: 0x840)
struct ABP_MerchantCrate_Static_Wieldable_C : AStaticMerchantCrate {
	struct ULightWeightStatusEffectManagerComponent* LightweightStatusEffectManager; // 0x840(0x08)
	struct UFlammableWieldableComponent* FlammableWieldable; // 0x848(0x08)
	struct UBoxComponent* HitVolume; // 0x850(0x08)
	struct UWieldableInteractableComponent* WieldableInteractable; // 0x858(0x08)
	struct UPickupableComponent* Pickupable; // 0x860(0x08)
	struct UUsableWieldableComponent* UsableWieldable; // 0x868(0x08)
	struct UFeedingComponent* Feeding; // 0x870(0x08)
	struct UMountpointComponent* Mountpoint; // 0x878(0x08)

	void UserConstructionScript(); // Function BP_MerchantCrate_Static_Wieldable.BP_MerchantCrate_Static_Wieldable_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1870810
};

