// AnimBlueprintGeneratedClass BP_Pig_AnimationInstance.BP_Pig_AnimationInstance_C
// Size: 0x9141 (Inherited: 0x1420)
struct UBP_Pig_AnimationInstance_C : UFaunaAnimationInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1420(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_62FAD2374E41FC30AE0854B3698FACC3; // 0x1428(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D5F1FFB942A6E1FACF6C798B32BE83F4; // 0x1470(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6CC64FA74FA116D3AA87EB9C0A97C901; // 0x14b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_768DAF94443E421205FEAFA35331AF95; // 0x14f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D28359EA4F74179B79BC9F8D4BAE488A; // 0x1530(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B0283C7847C85EE8945E50BB6E425E49; // 0x1570(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1A6EB76B412459ED6E0F1EBA6B5431F7; // 0x15b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A0D0B9094AEFB14F3D5423945E75D465; // 0x15f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CC181A47432D80BFA04C999C96E9474E; // 0x1630(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B23C1CCE4809AA64B0BBF1B94AFEDF3F; // 0x1670(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_813586EA42543F409899BDADE26C20C4; // 0x16b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E4C106E4432F3D4FC6A4E7B2B18D4470; // 0x16f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7453C76440C981BB92679FAA0C617CB1; // 0x1730(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E616474747F6437024211CA65FEC8A6A; // 0x1770(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79D07AC742D9FBA5FB0D6E955983A168; // 0x17b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CC4E1509491BCAAB33CA768FCF126157; // 0x17f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DF3CFB61468F2367312525AB14FA7D40; // 0x1830(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CACE8C9847AA481DD0F710A2BB53C62F; // 0x1870(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AF6377BF40EF38958CA098AB6AB50079; // 0x18b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86A612A34426B6C0091A9E818776DB33; // 0x18f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28A2587D4F46532E44FF7788B4B307C7; // 0x1930(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EAD8BF0C4C3CE9EA225C52910A3F9B37; // 0x1970(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27BE7DF54CB02D367B1194842BF68CA3; // 0x19b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D9D5B8134F0AA5410A86819282BECD13; // 0x19f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6EC5C28D49C5191F191DF59F3A1A1D0A; // 0x1a30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3AC43F444D8FE631FB269C990002EC59; // 0x1a70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B3D52F964C0E05E6DC7DD7A864588F62; // 0x1ab0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_05B5A45048B9D9DC73CB35BCE31B3AF2; // 0x1af0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AC967BEA4E2CF82ABC356084D7847FCB; // 0x1b30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A810B69547B22F057D8D13B8CCE3BD41; // 0x1b70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1FE5EA2740C92852DF4217B8F34699A4; // 0x1bb0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BDA53578488DDEEB855B28A92AF8EDD4; // 0x1bf0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BBE769F7480BE676602227B02404D251; // 0x1c30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A6C94CAD487ED21F2A8A8A8665DE66DC; // 0x1c70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_061816444CCA5CA5003274B866ADA6EA; // 0x1cb0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_491063F342932DCBA3A1B1ADA90864F9; // 0x1cf0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2265661E41A82A93A78AC08E4CFB7A33; // 0x1d30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43FE702D49C132A895B0D187EAA3DE61; // 0x1d70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6223E51949CCB2264610269D0F171794; // 0x1db0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D8C645EC4F8AF21FF845F683ABDD89DA; // 0x1df0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D4B4C1BC4014B94513F96DB59BCA72D4; // 0x1e30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9A2DF59341C82251628324A2A0DDAE6D; // 0x1e70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2AC5151042CFF73D4BA96A974AE14C3F; // 0x1eb0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B5FF099B492A20CC8EB33093E75BF893; // 0x1ef0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9950A46B44AE075B900D499AF825A8D6; // 0x1f30(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EBA423AC4141CFFFAAF1779B88813909; // 0x1f70(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68670C8D4AC62C359F7289A4EBD22B03; // 0x1fb0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0617CAAF4AB46E4719E54AB1FA244594; // 0x1ff0(0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_CBC0779E4EBD5951BB84A4B0E987463C; // 0x2030(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_FAC40DCA45D9643FA645D5A98C729EDD; // 0x2080(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8C4EA043403B17E5F783CDAB9FF9661F; // 0x20c8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_417DD50440AD739867B284867C92DDE8; // 0x2128(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_22D3322E460E64641DDCE8B51CDFF333; // 0x2170(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_75D4ADB241429011AE9779B4F5EC86F3; // 0x2218(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B93D7D774603348EF44840BBE38160BF; // 0x2260(0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8D9723F245F3D996084B4EA3DCB9C490; // 0x22a0(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_56ACCAF347A330E1C71863862815A091; // 0x22f0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_EE37AF3E43AC870489BE8E8AD476173A; // 0x2338(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_BBBF174A45C960247994B0AD65A95DC4; // 0x2398(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_B97EFF7E4F33BBBE3A3C1D93AE9E0B7B; // 0x23e0(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_EBB30E9F47B9F96FC92D268C504AB261; // 0x2488(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_A6248B35470BB75B63EFD7AECE52FFF8; // 0x24d0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D2A7DE864F90C6B9FD00F39B5C341858; // 0x2518(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_A8ABE58E43C651E722D3ACA2A7C6163D; // 0x2560(0x90)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5342C6EC4012E056830300A3E34081B9; // 0x25f0(0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12316D5A4EF341D1ECDF2E9ABAB5CBA6; // 0x2630(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_66A6F0484554F382C4731F9E5C488BFB; // 0x2680(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1EF3CA5141C2EA0E9FB83281AA8DC8B3; // 0x26c8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_713A3A1C444F035308362BB2CC6E5579; // 0x2728(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_44A3D90D4194DDEE54366DA31A0CC411; // 0x2770(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_00C8CCEE4E07DBB38BFC259823F8C905; // 0x2818(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26F43CD34E1DB6ECE56A8F8D7A4FBC09; // 0x2860(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9E4BDEAD4A21E33368849E9E618E751B; // 0x28c0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B5CB52B2419AE51927CA13BA24800345; // 0x2970(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_EDF9D59249F7C78DFD1A469B5F063F34; // 0x29d0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34AB8D124EA70BDEA6B9F4BDD856B516; // 0x2a18(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9C38AC7D42B46B3F2630E3A47AC9885F; // 0x2a78(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5988C3AC4A3460CC358482ADF0ED424D; // 0x2b28(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6CF769874738187A47B1CE9D8B119701; // 0x2b88(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8152219B480C0ECCE6F097A359DA3CCF; // 0x2bd0(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_D546F8494A991796883FEFA47B40D2A4; // 0x2c30(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_423754DF46770FFCECF1458898FFF6C3; // 0x2ce0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6AE00FEF478F9234AD9473825352AED6; // 0x2d40(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76937AFB4C4E1020965F0EB155E98AD7; // 0x2d88(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_9AB1608844AC5734C95AD4A2EC1AE0BD; // 0x2de8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_BE1136EA4F5D03CC865773AC4CD33F8E; // 0x2e30(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B172C1DA4FD0428FE8B62E862EC1036E; // 0x2e90(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_413F93FF42D9929F18EA40980B37D45E; // 0x2ed8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_7D445414459939387C3ED7B2169250A3; // 0x2f38(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D84E9F4D451FEAD3ABB864BEA66CEE16; // 0x2f80(0x40)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_212536CE43B8C8E8F852CF988B4F6B2C; // 0x2fc0(0x118)
	struct FAnimNode_Root AnimGraphNode_StateResult_C37BBC6E46B340F4521FA28A0D446D29; // 0x30d8(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_0E41AB1844F73427EC7EAA8A913ABA21; // 0x3120(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_83E61C244F62DBE1FBDBBB9AE3C27F4D; // 0x3230(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_57FE71424A1495750C1742BA8EDDB0E3; // 0x3278(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_24D1CC894E2CD02F5411F4AA6E5CDAA0; // 0x3320(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_398FC5F846A9CE7834D62CB6E9FB52F0; // 0x3368(0x40)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_9C266052420036A9B4DE94A7A8462114; // 0x33a8(0x118)
	struct FAnimNode_Root AnimGraphNode_StateResult_C6985FB44A28ED203FC73A8679238947; // 0x34c0(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7F55EF90441C7E3DC26E04B264099A8C; // 0x3508(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_879EE7BC4E19D9F4CDF5DEB87870FDFF; // 0x3618(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9D948A72425E3BA10FECBAA411896136; // 0x3660(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_F7322C2C47A17DD4E23DB396FC7FE629; // 0x3708(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7601B200443F3EFC5CB4639CC414625C; // 0x3750(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8E34E7D446C06A7B429835A1C99338FA; // 0x3798(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_EFD671A74E5693C17AAA389E8010B0B0; // 0x37e0(0x90)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DB718A9A43B3749DC3AB6CBDAD53BCA4; // 0x3870(0x40)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_B68EF8B14117BB61D0F59B90A8AD1D35; // 0x38b0(0x118)
	struct FAnimNode_Root AnimGraphNode_StateResult_66B6874D4572A3709FBCC09E20278424; // 0x39c8(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_B02AEFC04B8EB1E3193814895768873B; // 0x3a10(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_24F534044AA9316D9069A79869E7777F; // 0x3b20(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_BD0FCFFF46F4903FF56C62B0081000B6; // 0x3b68(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_931AD54740756FAA3CBC43B31F5A9FDC; // 0x3c10(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CE2156EE49DBAB5B21A720B60D56D5803; // 0x3c58(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CB2B176943BE10A49619F58E737BF6A53; // 0x3c98(0x40)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_A5F99A104BFEBA8CC21FF08162D6D9753; // 0x3cd8(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_465F6A424A8EA1FB3503CFA9865A25AA3; // 0x3de8(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3375874D41230D21B77FDCBC7145A9553; // 0x3e30(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_B23029A9406B0ACFCBE28CA6B57FB4A43; // 0x3f40(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2CAFFFF14153C4DA73B9318F97C758EF; // 0x3f88(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_759FC02C48E183189ACA0E87CD7C1342; // 0x4030(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CE2156EE49DBAB5B21A720B60D56D5802; // 0x4078(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CB2B176943BE10A49619F58E737BF6A52; // 0x40b8(0x40)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_A5F99A104BFEBA8CC21FF08162D6D9752; // 0x40f8(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_465F6A424A8EA1FB3503CFA9865A25AA2; // 0x4208(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3375874D41230D21B77FDCBC7145A9552; // 0x4250(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_B23029A9406B0ACFCBE28CA6B57FB4A42; // 0x4360(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_C63ABFC34214677A6FD91F985CA3524C; // 0x43a8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_3FC8A1854EDD4859DD5B7089F2946FF3; // 0x4450(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_CD3CE01F4F15CDE9DE0EF9BDF5DC3816; // 0x4498(0x90)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C339ECF944A7A5663CA85384930497D8; // 0x4528(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_E856D22745F45E52D29A968F60AAB573; // 0x4570(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CE2156EE49DBAB5B21A720B60D56D580; // 0x45b8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_CB2B176943BE10A49619F58E737BF6A5; // 0x45f8(0x40)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_A5F99A104BFEBA8CC21FF08162D6D975; // 0x4638(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_465F6A424A8EA1FB3503CFA9865A25AA; // 0x4748(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3375874D41230D21B77FDCBC7145A955; // 0x4790(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_B23029A9406B0ACFCBE28CA6B57FB4A4; // 0x48a0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_B3016DCE4FD5463DF2E46F8E40733C80; // 0x48e8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_E91BA1A542F22EC38E89CF91504736BD; // 0x4990(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7277D2B447E4592211212499A2CC06FD; // 0x49d8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E17A4A5C45B2623259A7109738FF8D22; // 0x4a18(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87CF0D2A41AA222C002305B3E71C86BD; // 0x4a58(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EE39121F4B1CC3658BF28399FC819B45; // 0x4a98(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9889E88E4FD96D6C95012084660284AC; // 0x4ad8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5D5D6D9C441825AD991DBDAB0BEA62F2; // 0x4b18(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_02C7CE63451E4EBDEA232FAC07B4C81E; // 0x4b58(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_FF9566434FFFA1F399EBDF891BAF3033; // 0x4b98(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_830A144D440BFC13D5B9CCB0D9AC761F; // 0x4bd8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62E1764F4F154366BE4CD18CE81D35AB; // 0x4c18(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5C600CE1475C5F9D5A1561B057D83A88; // 0x4c58(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6AE08F9C4BF76A1489A34695462EB465; // 0x4c98(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_621FFB284A7097868867629F3F0D9643; // 0x4cd8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9289D5224E5BC7290F36909BE8DFA8CF; // 0x4d18(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F826; // 0x4d58(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A596; // 0x4db8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F825; // 0x4e00(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A595; // 0x4e60(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3938D1D949DCE71C6CA48E849432C5CC3; // 0x4ea8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_171E81CA45FB326D0D4F1FA28543F93C3; // 0x4f08(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_582F062A4C91109AE7104ABF853E93893; // 0x4f50(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_020CCD214E6A9993B946398A127A314D3; // 0x4f90(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DCE7015A4C5E6C80FE275CBC15A65B053; // 0x4ff0(0x60)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_690B883A4AD74A477BFECEB1CBDCDEC43; // 0x5050(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DC557474464FBF740CB3109563C9162B3; // 0x5110(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_8042F68443B4B3B5063A9B826B1050C63; // 0x5170(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9B92BB494CF0F29D0CE297A216AE32453; // 0x51b8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_0339A9EA413385E5D3818A9DD6EF78463; // 0x5218(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_FA7167A7469CC3D68065D4B6E7406C603; // 0x5260(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_ED59FFB546F12C74D98C3AB81FEF5E633; // 0x5308(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC4312; // 0x5350(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF420910812; // 0x5390(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A12; // 0x53f0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B91012; // 0x5438(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF12; // 0x5498(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_68BBDB834F5AA65203D35B9F4FB0DF6C; // 0x54e0(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC4311; // 0x5588(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF420910811; // 0x55c8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A11; // 0x5628(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B91011; // 0x5670(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF11; // 0x56d0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D95A4EFC4E673F2DAAE5A2BA26E9FFE7; // 0x5718(0xa8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5F6102D14F6B3777598F72BC0B5B2472; // 0x57c0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D21B9B384C1E1C465BEA438BB9F0A937; // 0x5880(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_52BEDCBC4DD8F27410A274944D48C300; // 0x58e0(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC4310; // 0x5928(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF420910810; // 0x5968(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A10; // 0x59c8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B91010; // 0x5a10(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF10; // 0x5a70(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D354541641627935FBE5DDB76F5C02BD; // 0x5ab8(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC439; // 0x5b60(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091089; // 0x5ba0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A9; // 0x5c00(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9109; // 0x5c48(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF9; // 0x5ca8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5C063B144F9E55194975F5ABF0AE1D41; // 0x5cf0(0xa8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_C7FC59844F71CCD411A9918B092F3893; // 0x5d98(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23B6F3DC487D377E279A8EACB0CF39A6; // 0x5e58(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_633712F74269C06F1F08C393829AA773; // 0x5eb8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_A14E2DD74C1843346C7B8AB7FEB596E0; // 0x5f00(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_7380A8F4403FC9D56386D6B30C21038F; // 0x5fa8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2B42398E48E9EB052FCF29837F793860; // 0x5ff0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4D54AF434E0F0A6D0F406AA0585B3AFE; // 0x6030(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DDD04C104CAC8177318286A1361F9DA4; // 0x6070(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C5D6E86347848A0A40FB9885A49FA7B0; // 0x60b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F094514B47799CDA3A426FBF34BD98AB; // 0x60f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30A5C85C491BFEF48849B9825451BEB6; // 0x6130(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E66AD8114B67E6B7E5CA9EBE1B4B85E4; // 0x6170(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C0D879214A3E2C1039EBE1A1223C2A4C; // 0x61b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_466A04B04AB713859CFEDC82511C5559; // 0x61f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9F935F214E1ADF5EB3FE2FA3ACD54950; // 0x6230(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F99C59AC43E470BE6771E49CDC75FE2A; // 0x6270(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F824; // 0x62b0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A594; // 0x6310(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F823; // 0x6358(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A593; // 0x63b8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3938D1D949DCE71C6CA48E849432C5CC2; // 0x6400(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_171E81CA45FB326D0D4F1FA28543F93C2; // 0x6460(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_582F062A4C91109AE7104ABF853E93892; // 0x64a8(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_020CCD214E6A9993B946398A127A314D2; // 0x64e8(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DCE7015A4C5E6C80FE275CBC15A65B052; // 0x6548(0x60)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_690B883A4AD74A477BFECEB1CBDCDEC42; // 0x65a8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DC557474464FBF740CB3109563C9162B2; // 0x6668(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_8042F68443B4B3B5063A9B826B1050C62; // 0x66c8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9B92BB494CF0F29D0CE297A216AE32452; // 0x6710(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_0339A9EA413385E5D3818A9DD6EF78462; // 0x6770(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_FA7167A7469CC3D68065D4B6E7406C602; // 0x67b8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_ED59FFB546F12C74D98C3AB81FEF5E632; // 0x6860(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC438; // 0x68a8(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091088; // 0x68e8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A8; // 0x6948(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9108; // 0x6990(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF8; // 0x69f0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_019399AB461F5F17F772A69E9195AA00; // 0x6a38(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC437; // 0x6ae0(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091087; // 0x6b20(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A7; // 0x6b80(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9107; // 0x6bc8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF7; // 0x6c28(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_C5542D3D44536C8C7A4C3B81093EA8F5; // 0x6c70(0xa8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_477F652C46B7A50B131E07A54D46721A; // 0x6d18(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A2AA426A45F607C2C47F8082BA93D9E9; // 0x6dd8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6D8379DE495E670AA93C8F8FFCD0B95A; // 0x6e38(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC436; // 0x6e80(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091086; // 0x6ec0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A6; // 0x6f20(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9106; // 0x6f68(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF6; // 0x6fc8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2CB4DAD3409362AFE26DAA80CAE7EC9B; // 0x7010(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC435; // 0x70b8(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091085; // 0x70f8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A5; // 0x7158(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9105; // 0x71a0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF5; // 0x7200(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_774C101B406AFD15B4F825835A382861; // 0x7248(0xa8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6956B5754DF819F0CB2011880E985B79; // 0x72f0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_AE735047403881E292213CB826ECA34C; // 0x73b0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_E0582B34465592EA3722A7816D468C1D; // 0x7410(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_707A9672484E71E4C03E75BAD423596A; // 0x7458(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_8B079D4D4B937A634F427AB9D906857C; // 0x7500(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64260F484942DCAF553103AFB4FD0009; // 0x7548(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3811E1EE4060F70CE72C4BA3356552B9; // 0x7588(0x40)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_73FBE6EA4A42E1E8C07399B44B10C509; // 0x75c8(0x90)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0F892A114DC187691D7517BD0245D1AD; // 0x7658(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8F3AE97141B83DDEC68580BD1133E4C1; // 0x76a0(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AF30DE914E6C8AEE56697096741F93C9; // 0x76e8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BC2B0B3F4250C9C9B683E88DE456F341; // 0x7728(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DE0E7FA946285EE8043B76B9A55C5A8E; // 0x7768(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9CC7DA2C4F681E97EAA6EBBF928B4A6C; // 0x77a8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DFBB2FA84B3CF3283B60E7A236841D76; // 0x77e8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_ED43398E4A2491B8AE0335874C694F6B; // 0x7828(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BFD455514212D0A5EA65279FAC2FC65A; // 0x7868(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F6C115E84A0769C7392DC397CCD166B4; // 0x78a8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0F92A4184381E28296ADD68ED3CB26BF; // 0x78e8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7150142443603677D6F231A83E3724E2; // 0x7928(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F08A6DD242C2FED21191BD81B2FC1976; // 0x7968(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_942425CA4815D5BD53D136BD6810ED07; // 0x79a8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_DB5A503C40BB3C2BFAA4C7B1DF1C053D; // 0x79e8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4BAE55F649E5C3E90DEAF5A23AA979CE; // 0x7a28(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F83B14F740C8427409BD9FBA40FCEF3D; // 0x7a68(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0F73B8B84B141F14AF0C1C9B2E614CCE; // 0x7aa8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1266EB194A63C851C535678D661F5377; // 0x7ae8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A5CAA1B4469EF3E7E2603490D077177B; // 0x7b28(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_851397BA44844F676E0AD0BA64C0A96F; // 0x7b68(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B6FFA6414A2CC1B2C7A5CDB132D72B5F; // 0x7ba8(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F822; // 0x7be8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A592; // 0x7c48(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C2D44D614DB4B7B65B3E249E98CF8F82; // 0x7c90(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AAFCB03045E6E0763EA9C4816E8B1A59; // 0x7cf0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3938D1D949DCE71C6CA48E849432C5CC; // 0x7d38(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_171E81CA45FB326D0D4F1FA28543F93C; // 0x7d98(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_582F062A4C91109AE7104ABF853E9389; // 0x7de0(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_020CCD214E6A9993B946398A127A314D; // 0x7e20(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DCE7015A4C5E6C80FE275CBC15A65B05; // 0x7e80(0x60)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_690B883A4AD74A477BFECEB1CBDCDEC4; // 0x7ee0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_DC557474464FBF740CB3109563C9162B; // 0x7fa0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_8042F68443B4B3B5063A9B826B1050C6; // 0x8000(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9B92BB494CF0F29D0CE297A216AE3245; // 0x8048(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_0339A9EA413385E5D3818A9DD6EF7846; // 0x80a8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_FA7167A7469CC3D68065D4B6E7406C60; // 0x80f0(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_ED59FFB546F12C74D98C3AB81FEF5E63; // 0x8198(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_299A443F40722765B55414AC3680D365; // 0x81e0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_86BE80F84E9E77373DF1AAA3286B727B; // 0x8240(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3E7DE8604D953ADCD748399C0CA7EE38; // 0x8288(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_D854AB134836723E63C62C8BC8CF2395; // 0x82e8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_855963844EFF76823E7E018ED059D544; // 0x8330(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC434; // 0x8370(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091084; // 0x83b0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A4; // 0x8410(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9104; // 0x8458(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF4; // 0x84b8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_19BBEBEB4E439D07C5B07C80A312162D; // 0x8500(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC433; // 0x85a8(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091083; // 0x85e8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A3; // 0x8648(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9103; // 0x8690(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF3; // 0x86f0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_222BDFAC43C912F21983C6A286DC7374; // 0x8738(0xa8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9EE7C3834C4A7C6AE9056598E73D9992; // 0x87e0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5A3A852D46F1459FF57A6DA0A0FBE945; // 0x88a0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_A784DBA645E7F3837254868F814CC731; // 0x8900(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC432; // 0x8948(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF42091082; // 0x8988(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A2; // 0x89e8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B9102; // 0x8a30(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF2; // 0x8a90(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_B613F3494C14D25EC10CF48CDFBDC585; // 0x8ad8(0xa8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30783B534ABFAD5A424958A396AEDC43; // 0x8b80(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_505477BF46EF5CA5E7FA33BCF4209108; // 0x8bc0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B5D13BBA441A054A4898CEBB68599C8A; // 0x8c20(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_ADDE0B77496E66F3D50238B77F47B910; // 0x8c68(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_122686704F8E57BEABB4D7BF4E8C26EF; // 0x8cc8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_DF2F959B4A0D7946B840769A1F9B7A74; // 0x8d10(0xa8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_386EDAA8428D6A2B1716EC8D66963E9B; // 0x8db8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2173EF884406C512A15FD8925076BE42; // 0x8e78(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6986FD5A4966E285FC1036AA521E92DC; // 0x8ed8(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_A708DB0545F072CD6847A68242EF6959; // 0x8f20(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_E85C314D419727F4A5F5529F13476687; // 0x8fc8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AA7328954BCCAE7FBA3AA9ACC3D666A7; // 0x9010(0x40)
	struct FAnimNode_Root AnimGraphNode_StateResult_D6A5B2D94B58F1D69208E9A0964B88EA; // 0x9050(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_C8C975DD49BC6D460E3A97A02213979D; // 0x9098(0xa8)
	bool Flee; // 0x9140(0x01)

	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_D5F1FFB942A6E1FACF6C798B32BE83F4(); // Function BP_Pig_AnimationInstance.BP_Pig_AnimationInstance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_D5F1FFB942A6E1FACF6C798B32BE83F4 // BlueprintEvent // @ game+0x1870810
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_6CC64FA74FA116D3AA87EB9C0A97C901(); // Function BP_Pig_AnimationInstance.BP_Pig_AnimationInstance_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Pig_AnimationInstance_AnimGraphNode_TransitionResult_6CC64FA74FA116D3AA87EB9C0A97C901 // BlueprintEvent // @ game+0x1870810
