// BlueprintGeneratedClass BP_PortableAmmoCrate_Wieldable.BP_PortableAmmoCrate_Wieldable_C
// Size: 0x820 (Inherited: 0x7e0)
struct ABP_PortableAmmoCrate_Wieldable_C : ALargeStaticMeshWieldableItem {
	struct UMaterialManipulationComponent* MaterialManipulation; // 0x7e0(0x08)
	struct UWwiseEmitterComponent* WwiseEmitter; // 0x7e8(0x08)
	struct UAmmoStoreComponent* AmmoStore; // 0x7f0(0x08)
	struct UAddReloadAmmoActionRuleComponent* AddReloadAmmoActionRule; // 0x7f8(0x08)
	struct UBoxComponent* HitVolume; // 0x800(0x08)
	struct UPickupableComponent* Pickupable; // 0x808(0x08)
	struct UUsableWieldableComponent* UsableWieldable; // 0x810(0x08)
	struct UWieldableInteractableComponent* WieldableInteractable; // 0x818(0x08)

	void UserConstructionScript(); // Function BP_PortableAmmoCrate_Wieldable.BP_PortableAmmoCrate_Wieldable_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1870810
};

