// BlueprintGeneratedClass BP_sod_bld_tvn_ngs_fancypiratecode_01_a.BP_sod_bld_tvn_ngs_fancypiratecode_01_a_C
// Size: 0x498 (Inherited: 0x3c8)
struct ABP_sod_bld_tvn_ngs_fancypiratecode_01_a_C : AActor {
	struct UParticleSystemComponent* ParticleSystemComponent02; // 0x3c8(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent01; // 0x3d0(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent0; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x3e0(0x08)
	struct USpotLightComponent* LightComponent02; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x3f8(0x08)
	struct UPointLightComponent* LightComponent01; // 0x400(0x08)
	struct UPointLightComponent* LightComponent0; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x440(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x488(0x08)
	struct USceneComponent* SharedRoot; // 0x490(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_tvn_ngs_fancypiratecode_01_a.BP_sod_bld_tvn_ngs_fancypiratecode_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

