// BlueprintGeneratedClass BP_sod_bld_gld_enc_shop_int_dressing_01_a.BP_sod_bld_gld_enc_shop_int_dressing_01_a_C
// Size: 0x730 (Inherited: 0x3c8)
struct ABP_sod_bld_gld_enc_shop_int_dressing_01_a_C : AActor {
	struct UStaticMeshComponent* StaticMesh1; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x3d0(0x08)
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3d8(0x08)
	struct UBoxComponent* Box9; // 0x3e0(0x08)
	struct UStaticMeshComponent* Cylinder; // 0x3e8(0x08)
	struct UBoxComponent* Box8; // 0x3f0(0x08)
	struct UBoxComponent* Box7; // 0x3f8(0x08)
	struct UBoxComponent* Box6; // 0x400(0x08)
	struct UBoxComponent* Box5; // 0x408(0x08)
	struct UBoxComponent* Box4; // 0x410(0x08)
	struct UBoxComponent* Box3; // 0x418(0x08)
	struct UBoxComponent* Box2; // 0x420(0x08)
	struct UBoxComponent* Box1; // 0x428(0x08)
	struct UBoxComponent* Box; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent090; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent089; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent088; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent087; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0x480(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent081; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent080; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent079; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent078; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent077; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent076; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent075; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent074; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent073; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent072; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent071; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent070; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent068; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent063; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent062; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent060; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x720(0x08)
	struct USceneComponent* SharedRoot; // 0x728(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_gld_enc_shop_int_dressing_01_a.BP_sod_bld_gld_enc_shop_int_dressing_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

