// BlueprintGeneratedClass BP_sod_bld_wpn_shop_01_a.BP_sod_bld_wpn_shop_01_a_C
// Size: 0x640 (Inherited: 0x3c8)
struct ABP_sod_bld_wpn_shop_01_a_C : AActor {
	struct UStaticMeshComponent* StaticMesh1; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x3d0(0x08)
	struct USpotLightComponent* SpotLight1; // 0x3d8(0x08)
	struct UStaticMeshComponent* sod_bld_sign_03_a; // 0x3e0(0x08)
	struct UBoxComponent* BoxCollision_03; // 0x3e8(0x08)
	struct UStaticMeshComponent* cmn_cannon_ball_01_a2; // 0x3f0(0x08)
	struct UStaticMeshComponent* cmn_cannon_ball_01_a1; // 0x3f8(0x08)
	struct UStaticMeshComponent* cmn_cannon_ball_01_a; // 0x400(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_anvil_01_a; // 0x408(0x08)
	struct UStaticMeshComponent* sod_bld_wpn_shop_sign_01_a1; // 0x410(0x08)
	struct UStaticMeshComponent* sod_bld_wpn_shop_sign_01_a; // 0x418(0x08)
	struct UBoxComponent* BoxCollision_02; // 0x420(0x08)
	struct UBoxComponent* BoxCollision_01; // 0x428(0x08)
	struct UStaticMeshComponent* cmn_rope_04_c; // 0x430(0x08)
	struct UStaticMeshComponent* cmn_rope_end_01_a; // 0x438(0x08)
	struct UStaticMeshComponent* cmn_rope_end_06_a; // 0x440(0x08)
	struct UStaticMeshComponent* shp_int_hook_01_a; // 0x448(0x08)
	struct UStaticMeshComponent* sod_bld_wpn_shop_dressing_01_b; // 0x450(0x08)
	struct UPointLightComponent* PointLight2; // 0x458(0x08)
	struct UParticleSystemComponent* ParticleSystem6; // 0x460(0x08)
	struct UParticleSystemComponent* ParticleSystem5; // 0x468(0x08)
	struct UStaticMeshComponent* cmn_candle_01_b; // 0x470(0x08)
	struct UStaticMeshComponent* cmn_candle_01_a; // 0x478(0x08)
	struct UStaticMeshComponent* cmn_rope_end_02_a; // 0x480(0x08)
	struct UStaticMeshComponent* gmp_bar_stor_01_a1; // 0x488(0x08)
	struct UStaticMeshComponent* gmp_bar_stor_01_a; // 0x490(0x08)
	struct UStaticMeshComponent* sod_bld_barrel_netting_01_a; // 0x498(0x08)
	struct UStaticMeshComponent* cmn_dbl_barrel_pistol_03_a; // 0x4a0(0x08)
	struct UStaticMeshComponent* shp_pistol_rack_01_a; // 0x4a8(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a1; // 0x4b0(0x08)
	struct UStaticMeshComponent* bld_tvn_metal_chimney_01_b; // 0x4b8(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b; // 0x4c0(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a1; // 0x4c8(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_b2; // 0x4d0(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_a1; // 0x4d8(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_b1; // 0x4e0(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_c2; // 0x4e8(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_b; // 0x4f0(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_c1; // 0x4f8(0x08)
	struct UStaticMeshComponent* sod_bld_floor_02_a1; // 0x500(0x08)
	struct UStaticMeshComponent* sod_bld_floor_02_a; // 0x508(0x08)
	struct UStaticMeshComponent* gmp_bar_stor_three_stack_01_a; // 0x510(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_sign_standing_01_a; // 0x518(0x08)
	struct UStaticMeshComponent* sod_bld_wpn_shop_dressing_01_a; // 0x520(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_hanging_target_broken_01_a; // 0x528(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a; // 0x530(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_furnace_01_c; // 0x538(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_c; // 0x540(0x08)
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x548(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x550(0x08)
	struct USpotLightComponent* SpotLight10; // 0x558(0x08)
	struct USpotLightComponent* SpotLight9; // 0x560(0x08)
	struct USpotLightComponent* SpotLight8; // 0x568(0x08)
	struct UChildActorComponent* BP_IslandWeaponsChest; // 0x570(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x580(0x08)
	struct UPointLightComponent* PointLight5; // 0x588(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x590(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x598(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x5a0(0x08)
	struct USpotLightComponent* SpotLight6; // 0x5a8(0x08)
	struct UStaticMeshComponent* tls_lantern_01_d; // 0x5b0(0x08)
	struct UPointLightComponent* PointLight4; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMesh33; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMesh32; // 0x5c8(0x08)
	struct USpotLightComponent* SpotLight4; // 0x5d0(0x08)
	struct USpotLightComponent* SpotLight3; // 0x5d8(0x08)
	struct UPointLightComponent* PointLight; // 0x5e0(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x5e8(0x08)
	struct USpotLightComponent* SpotLight; // 0x5f0(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x618(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_doorframe_01_a; // 0x620(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_window_01_a; // 0x628(0x08)
	struct UStaticMeshComponent* bld_wpn_shop_door_01_a; // 0x630(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x638(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_wpn_shop_01_a.BP_sod_bld_wpn_shop_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

