// BlueprintGeneratedClass BP_sod_bld_sov_shell_01_a.BP_sod_bld_sov_shell_01_a_C
// Size: 0x13d0 (Inherited: 0x3c8)
struct ABP_sod_bld_sov_shell_01_a_C : AActor {
	struct UStaticMeshComponent* StaticMesh3; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x3d0(0x08)
	struct UBoxComponent* Box34; // 0x3d8(0x08)
	struct UBoxComponent* Box33; // 0x3e0(0x08)
	struct UBoxComponent* Box32; // 0x3e8(0x08)
	struct UChildActorComponent* AudioSpace; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x3f8(0x08)
	struct UCompanyRegionComponent* CompanyRegion; // 0x400(0x08)
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x408(0x08)
	struct UBoxComponent* Box31; // 0x410(0x08)
	struct UBoxComponent* Box30; // 0x418(0x08)
	struct UBoxComponent* Box29; // 0x420(0x08)
	struct UBoxComponent* Box28; // 0x428(0x08)
	struct UBoxComponent* Box27; // 0x430(0x08)
	struct UBoxComponent* Box26; // 0x438(0x08)
	struct UBoxComponent* Box25; // 0x440(0x08)
	struct UBoxComponent* Box24; // 0x448(0x08)
	struct UBoxComponent* Box23; // 0x450(0x08)
	struct UBoxComponent* Box22; // 0x458(0x08)
	struct UBoxComponent* Box21; // 0x460(0x08)
	struct UBoxComponent* Box20; // 0x468(0x08)
	struct UBoxComponent* Box19; // 0x470(0x08)
	struct UBoxComponent* Box18; // 0x478(0x08)
	struct UBoxComponent* Box17; // 0x480(0x08)
	struct UBoxComponent* Box16; // 0x488(0x08)
	struct UBoxComponent* Box15; // 0x490(0x08)
	struct UBoxComponent* Box14; // 0x498(0x08)
	struct UBoxComponent* Box13; // 0x4a0(0x08)
	struct UBoxComponent* Box12; // 0x4a8(0x08)
	struct UBoxComponent* Box11; // 0x4b0(0x08)
	struct UBoxComponent* Box10; // 0x4b8(0x08)
	struct UBoxComponent* Box9; // 0x4c0(0x08)
	struct UBoxComponent* Box8; // 0x4c8(0x08)
	struct UBoxComponent* Box7; // 0x4d0(0x08)
	struct UBoxComponent* Box6; // 0x4d8(0x08)
	struct UBoxComponent* Box5; // 0x4e0(0x08)
	struct UBoxComponent* Box4; // 0x4e8(0x08)
	struct UBoxComponent* Box3; // 0x4f0(0x08)
	struct UBoxComponent* Box2; // 0x4f8(0x08)
	struct UBoxComponent* Box1; // 0x500(0x08)
	struct UBoxComponent* Box; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0471; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0470; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0469; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0468; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0467; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0466; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0465; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0464; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0463; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0462; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0461; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0460; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0459; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0458; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0457; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0456; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0455; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0454; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0453; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0452; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0451; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0450; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0449; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0448; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0447; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0446; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0445; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0444; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0443; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0442; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0441; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0440; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0439; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0438; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0437; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0436; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0435; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0434; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0433; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0432; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0431; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0430; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0429; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0428; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0427; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0426; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0425; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0424; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0423; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0422; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0421; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0420; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0419; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0418; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0417; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0416; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0415; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0414; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0413; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0412; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0411; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0410; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0409; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0408; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0407; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0406; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0405; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0404; // 0x730(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0403; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0402; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0401; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0400; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0399; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0398; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0397; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0396; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0395; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0394; // 0x780(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0393; // 0x788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0392; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0391; // 0x798(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0390; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0389; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0388; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0387; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0386; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0385; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0384; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0383; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0382; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0381; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0380; // 0x7f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0379; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0378; // 0x800(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0377; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0376; // 0x810(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0375; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0374; // 0x820(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0373; // 0x828(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0372; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0371; // 0x838(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0370; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0369; // 0x848(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0368; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0367; // 0x858(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0366; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0365; // 0x868(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0364; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0363; // 0x878(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0362; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0361; // 0x888(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0360; // 0x890(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0359; // 0x898(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0358; // 0x8a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0357; // 0x8a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0356; // 0x8b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0355; // 0x8b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0354; // 0x8c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0353; // 0x8c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0352; // 0x8d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0351; // 0x8d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0350; // 0x8e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0349; // 0x8e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0348; // 0x8f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0347; // 0x8f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0346; // 0x900(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0345; // 0x908(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0344; // 0x910(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0343; // 0x918(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0342; // 0x920(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0341; // 0x928(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0340; // 0x930(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0339; // 0x938(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0338; // 0x940(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0335; // 0x948(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0334; // 0x950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0333; // 0x958(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0332; // 0x960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0331; // 0x968(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0330; // 0x970(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0329; // 0x978(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0328; // 0x980(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0327; // 0x988(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0326; // 0x990(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0325; // 0x998(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0324; // 0x9a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0323; // 0x9a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0322; // 0x9b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0321; // 0x9b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0320; // 0x9c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0319; // 0x9c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0318; // 0x9d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0317; // 0x9d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0316; // 0x9e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0315; // 0x9e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0314; // 0x9f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0313; // 0x9f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0312; // 0xa00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0311; // 0xa08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0310; // 0xa10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0309; // 0xa18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0308; // 0xa20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0307; // 0xa28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0306; // 0xa30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0305; // 0xa38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0304; // 0xa40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0303; // 0xa48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0302; // 0xa50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0301; // 0xa58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0300; // 0xa60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0299; // 0xa68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0298; // 0xa70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0297; // 0xa78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0296; // 0xa80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0295; // 0xa88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0294; // 0xa90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0293; // 0xa98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0292; // 0xaa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0291; // 0xaa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0290; // 0xab0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0289; // 0xab8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0288; // 0xac0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0287; // 0xac8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0286; // 0xad0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0285; // 0xad8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0284; // 0xae0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0283; // 0xae8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0282; // 0xaf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0281; // 0xaf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0280; // 0xb00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0279; // 0xb08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0278; // 0xb10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0277; // 0xb18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0276; // 0xb20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0275; // 0xb28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0274; // 0xb30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0273; // 0xb38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0272; // 0xb40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0271; // 0xb48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0270; // 0xb50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0269; // 0xb58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0268; // 0xb60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0267; // 0xb68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0266; // 0xb70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0265; // 0xb78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0264; // 0xb80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0263; // 0xb88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0262; // 0xb90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0261; // 0xb98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0260; // 0xba0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0259; // 0xba8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0258; // 0xbb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0257; // 0xbb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0256; // 0xbc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0255; // 0xbc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0254; // 0xbd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0253; // 0xbd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0252; // 0xbe0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0251; // 0xbe8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0250; // 0xbf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0249; // 0xbf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0248; // 0xc00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0247; // 0xc08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0246; // 0xc10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0245; // 0xc18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0244; // 0xc20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0243; // 0xc28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0242; // 0xc30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0241; // 0xc38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0240; // 0xc40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0239; // 0xc48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0238; // 0xc50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0237; // 0xc58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0236; // 0xc60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0235; // 0xc68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0234; // 0xc70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0233; // 0xc78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0232; // 0xc80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0231; // 0xc88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0230; // 0xc90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0229; // 0xc98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0228; // 0xca0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0227; // 0xca8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0226; // 0xcb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0225; // 0xcb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0224; // 0xcc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0223; // 0xcc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0222; // 0xcd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0221; // 0xcd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0220; // 0xce0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0219; // 0xce8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0218; // 0xcf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0217; // 0xcf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0216; // 0xd00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0215; // 0xd08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0214; // 0xd10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0213; // 0xd18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0212; // 0xd20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0211; // 0xd28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0210; // 0xd30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0209; // 0xd38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0208; // 0xd40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0207; // 0xd48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0206; // 0xd50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0205; // 0xd58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0204; // 0xd60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0203; // 0xd68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0202; // 0xd70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0201; // 0xd78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0200; // 0xd80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0199; // 0xd88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0198; // 0xd90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0197; // 0xd98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0196; // 0xda0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0195; // 0xda8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0194; // 0xdb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0193; // 0xdb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0192; // 0xdc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0191; // 0xdc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0190; // 0xdd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0189; // 0xdd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0188; // 0xde0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0187; // 0xde8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0186; // 0xdf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0185; // 0xdf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0184; // 0xe00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0183; // 0xe08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0182; // 0xe10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0181; // 0xe18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0180; // 0xe20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0179; // 0xe28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0178; // 0xe30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0177; // 0xe38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0176; // 0xe40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0175; // 0xe48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0174; // 0xe50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0173; // 0xe58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0172; // 0xe60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0171; // 0xe68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0170; // 0xe70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0169; // 0xe78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0168; // 0xe80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0167; // 0xe88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0166; // 0xe90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0165; // 0xe98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0164; // 0xea0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0163; // 0xea8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0162; // 0xeb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0161; // 0xeb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0160; // 0xec0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0159; // 0xec8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0158; // 0xed0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0157; // 0xed8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0156; // 0xee0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0155; // 0xee8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0154; // 0xef0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0153; // 0xef8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0152; // 0xf00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0151; // 0xf08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0150; // 0xf10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0149; // 0xf18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0148; // 0xf20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0147; // 0xf28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0146; // 0xf30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0145; // 0xf38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0144; // 0xf40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0143; // 0xf48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0142; // 0xf50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0141; // 0xf58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0140; // 0xf60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0139; // 0xf68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0138; // 0xf70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0137; // 0xf78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0136; // 0xf80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0135; // 0xf88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0134; // 0xf90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0133; // 0xf98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0132; // 0xfa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0131; // 0xfa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0130; // 0xfb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0129; // 0xfb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0128; // 0xfc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0127; // 0xfc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0126; // 0xfd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0125; // 0xfd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0124; // 0xfe0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0123; // 0xfe8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0122; // 0xff0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0121; // 0xff8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0120; // 0x1000(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0119; // 0x1008(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0118; // 0x1010(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0117; // 0x1018(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0116; // 0x1020(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0115; // 0x1028(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0114; // 0x1030(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0113; // 0x1038(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0112; // 0x1040(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0111; // 0x1048(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0110; // 0x1050(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0109; // 0x1058(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0108; // 0x1060(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0107; // 0x1068(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0106; // 0x1070(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0105; // 0x1078(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0104; // 0x1080(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0103; // 0x1088(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0102; // 0x1090(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0101; // 0x1098(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0100; // 0x10a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent099; // 0x10a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent098; // 0x10b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent097; // 0x10b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent096; // 0x10c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent095; // 0x10c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x10d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0x10d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0x10e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0x10e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent090; // 0x10f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent089; // 0x10f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent088; // 0x1100(0x08)
	struct UStaticMeshComponent* StaticMeshComponent087; // 0x1108(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0x1110(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0x1118(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0x1120(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0x1128(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0x1130(0x08)
	struct UStaticMeshComponent* StaticMeshComponent081; // 0x1138(0x08)
	struct UStaticMeshComponent* StaticMeshComponent080; // 0x1140(0x08)
	struct UStaticMeshComponent* StaticMeshComponent079; // 0x1148(0x08)
	struct UStaticMeshComponent* StaticMeshComponent078; // 0x1150(0x08)
	struct UStaticMeshComponent* StaticMeshComponent077; // 0x1158(0x08)
	struct UStaticMeshComponent* StaticMeshComponent076; // 0x1160(0x08)
	struct UStaticMeshComponent* StaticMeshComponent075; // 0x1168(0x08)
	struct UStaticMeshComponent* StaticMeshComponent074; // 0x1170(0x08)
	struct UStaticMeshComponent* StaticMeshComponent073; // 0x1178(0x08)
	struct UStaticMeshComponent* StaticMeshComponent072; // 0x1180(0x08)
	struct UStaticMeshComponent* StaticMeshComponent071; // 0x1188(0x08)
	struct UStaticMeshComponent* StaticMeshComponent070; // 0x1190(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0x1198(0x08)
	struct UStaticMeshComponent* StaticMeshComponent068; // 0x11a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0x11a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0x11b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0x11b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0x11c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent063; // 0x11c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent062; // 0x11d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0x11d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent060; // 0x11e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0x11e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0x11f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0x11f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x1200(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x1208(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0x1210(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0x1218(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0x1220(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x1228(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x1230(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x1238(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x1240(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x1248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x1250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x1258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x1260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x1268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x1270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x1278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x1280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x1288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x1290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x1298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x12a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x12a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x12b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x12b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x12c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x12c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x12d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x12d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x12e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x12e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x12f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x12f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x1300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x1308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x1310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x1318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x1320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x1328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x1330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x1338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x1340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x1348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x1350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x1358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x1360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x1368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x1370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x1378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x1380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x1388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x1390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x1398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x13a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x13a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x13b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x13b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x13c0(0x08)
	struct USceneComponent* SharedRoot; // 0x13c8(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_sov_shell_01_a.BP_sod_bld_sov_shell_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

