// BlueprintGeneratedClass BP_sod_bld_cls_shop_01_a.BP_sod_bld_cls_shop_01_a_C
// Size: 0x5c8 (Inherited: 0x3c8)
struct ABP_sod_bld_cls_shop_01_a_C : AActor {
	struct UStaticMeshComponent* bld_cls_shop_door_01_b; // 0x3c8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_window_01_b2; // 0x3d0(0x08)
	struct UStaticMeshComponent* bld_cls_shop_window_01_b1; // 0x3d8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_window_01_b; // 0x3e0(0x08)
	struct UStaticMeshComponent* cmn_cloth_09_a; // 0x3e8(0x08)
	struct UStaticMeshComponent* sod_bld_cls_shop_sign_01_a1; // 0x3f0(0x08)
	struct UStaticMeshComponent* sod_bld_cls_shop_sign_01_a; // 0x3f8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_doorframe_01_a1; // 0x400(0x08)
	struct UBoxComponent* BoxCollision_04; // 0x408(0x08)
	struct UBoxComponent* BoxCollision_03; // 0x410(0x08)
	struct UStaticMeshComponent* bld_cls_shop_doorframe_01_a; // 0x418(0x08)
	struct UStaticMeshComponent* gmp_bar_stor_01_a; // 0x420(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b; // 0x428(0x08)
	struct UStaticMeshComponent* sod_bld_cls_shop_dressing_01_b; // 0x430(0x08)
	struct UStaticMeshComponent* sod_bld_floor_02_a1; // 0x438(0x08)
	struct UStaticMeshComponent* sod_bld_floor_02_a; // 0x440(0x08)
	struct UStaticMeshComponent* sod_bld_beam_01_a; // 0x448(0x08)
	struct UStaticMeshComponent* cmn_rope_end_05_a1; // 0x450(0x08)
	struct UStaticMeshComponent* cmn_rope_end_05_a; // 0x458(0x08)
	struct UStaticMeshComponent* sod_bld_fence_03_a2; // 0x460(0x08)
	struct UStaticMeshComponent* sod_bld_fence_03_a1; // 0x468(0x08)
	struct UStaticMeshComponent* sod_bld_fence_03_a; // 0x470(0x08)
	struct UStaticMeshComponent* sod_bld_fence_02_a; // 0x478(0x08)
	struct UStaticMeshComponent* bld_cls_shp_sign_standing_01_a; // 0x480(0x08)
	struct UStaticMeshComponent* bld_cls_shp_sign_01_a; // 0x488(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_lid_01_a; // 0x490(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_01_c1; // 0x498(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_01_a; // 0x4a0(0x08)
	struct UStaticMeshComponent* sod_bld_cls_shop_dressing_01_a; // 0x4a8(0x08)
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x4b0(0x08)
	struct UStaticMeshComponent* bld_cls_shop_mannequin_01_a1; // 0x4b8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_mannequin_01_a; // 0x4c0(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x4c8(0x08)
	struct UBoxComponent* BoxCollision_02; // 0x4d0(0x08)
	struct UBoxComponent* BoxCollision_01; // 0x4d8(0x08)
	struct UStaticMeshComponent* bsp_cls_shop_dressing_01_a; // 0x4e0(0x08)
	struct USpotLightComponent* SpotLight8; // 0x4e8(0x08)
	struct USpotLightComponent* SpotLight7; // 0x4f0(0x08)
	struct UChildActorComponent* BP_IslandVanityChest; // 0x4f8(0x08)
	struct UStaticMeshComponent* bld_int_stool_02_a; // 0x500(0x08)
	struct UChildActorComponent* BP_IslandClothingChest; // 0x508(0x08)
	struct UChildActorComponent* ChildActor1; // 0x510(0x08)
	struct UChildActorComponent* ChildActor; // 0x518(0x08)
	struct UChildActorComponent* wsp_bottle_burner; // 0x520(0x08)
	struct USpotLightComponent* SpotLight6; // 0x528(0x08)
	struct USpotLightComponent* SpotLight3; // 0x530(0x08)
	struct USpotLightComponent* SpotLight1; // 0x538(0x08)
	struct USpotLightComponent* SpotLight; // 0x540(0x08)
	struct UPointLightComponent* PointLight; // 0x548(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* bld_cls_shop_hanging_cloth_03_a; // 0x558(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_02_a; // 0x560(0x08)
	struct UStaticMeshComponent* bld_enc_shop_rug_01_a; // 0x568(0x08)
	struct UStaticMeshComponent* bld_cls_shop_hanging_cloth_02_a; // 0x570(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_lid_01_c; // 0x578(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_lid_01_b; // 0x580(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_01_c; // 0x588(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_01_b; // 0x590(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_01_a; // 0x598(0x08)
	struct UStaticMeshComponent* bld_shop_rug_01_a; // 0x5a0(0x08)
	struct UStaticMeshComponent* bld_shop_table_01_a; // 0x5a8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_door_01_a; // 0x5b0(0x08)
	struct UStaticMeshComponent* bld_cls_shop_window_01_a2; // 0x5b8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x5c0(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_cls_shop_01_a.BP_sod_bld_cls_shop_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

