// BlueprintGeneratedClass BP_sod_bld_tvn_ngs_shell_01_a.BP_sod_bld_tvn_ngs_shell_01_a_C
// Size: 0x1e80 (Inherited: 0x3c8)
struct ABP_sod_bld_tvn_ngs_shell_01_a_C : AActor {
	struct UStaticMeshComponent* StaticMesh30; // 0x3c8(0x08)
	struct UStaticMeshComponent* sod_bld_door_06_a; // 0x3d0(0x08)
	struct UStaticMeshComponent* sod_bld_wall_06_b; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x400(0x08)
	struct UBoxComponent* Box21; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x418(0x08)
	struct UStaticMeshComponent* Rainblocker10; // 0x420(0x08)
	struct UStaticMeshComponent* Rainblocker9; // 0x428(0x08)
	struct UStaticMeshComponent* sod_bld_ngstavern_upper_ceiling_01_a; // 0x430(0x08)
	struct UStaticMeshComponent* Rainblocker8; // 0x438(0x08)
	struct UStaticMeshComponent* Rainblocker7; // 0x440(0x08)
	struct UStaticMeshComponent* Rainblocker6; // 0x448(0x08)
	struct UStaticMeshComponent* Rainblocker5; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x4b8(0x08)
	struct UChildActorComponent* AudioSpace; // 0x4c0(0x08)
	struct UStaticMeshComponent* Shadowcaster2; // 0x4c8(0x08)
	struct UStaticMeshComponent* ShadowCaster; // 0x4d0(0x08)
	struct UBoxComponent* Box20; // 0x4d8(0x08)
	struct UBoxComponent* Box19; // 0x4e0(0x08)
	struct UBoxComponent* Box18; // 0x4e8(0x08)
	struct UStaticMeshComponent* Rainblocker4; // 0x4f0(0x08)
	struct UStaticMeshComponent* Rainblocker3; // 0x4f8(0x08)
	struct UStaticMeshComponent* Rainblocker2; // 0x500(0x08)
	struct UStaticMeshComponent* Rainblocker; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x520(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_03_a; // 0x528(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_04_a1; // 0x530(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_04_a; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x548(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_02_a; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x558(0x08)
	struct UStaticMeshComponent* sod_bld_floor_trim_01_a; // 0x560(0x08)
	struct UBoxComponent* Box17; // 0x568(0x08)
	struct UBoxComponent* Box16; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x580(0x08)
	struct UStaticMeshComponent* sod_bld_beam_01_a; // 0x588(0x08)
	struct UBoxComponent* Box15; // 0x590(0x08)
	struct UBoxComponent* Box14; // 0x598(0x08)
	struct UBoxComponent* Box13; // 0x5a0(0x08)
	struct UBoxComponent* Box12; // 0x5a8(0x08)
	struct UBoxComponent* Box11; // 0x5b0(0x08)
	struct UBoxComponent* Box10; // 0x5b8(0x08)
	struct UBoxComponent* Box9; // 0x5c0(0x08)
	struct UBoxComponent* Box8; // 0x5c8(0x08)
	struct UBoxComponent* Box7; // 0x5d0(0x08)
	struct UBoxComponent* Box6; // 0x5d8(0x08)
	struct UBoxComponent* Box5; // 0x5e0(0x08)
	struct UBoxComponent* Box4; // 0x5e8(0x08)
	struct UBoxComponent* Box3; // 0x5f0(0x08)
	struct UBoxComponent* Box2; // 0x5f8(0x08)
	struct UBoxComponent* Box1; // 0x600(0x08)
	struct UBoxComponent* Box; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0809; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0808; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0807; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0806; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0805; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0804; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0803; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0802; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0801; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0800; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0799; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0798; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0797; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0796; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0795; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0794; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0793; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0792; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0791; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0790; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0789; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0788; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0787; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0786; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0785; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0784; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0783; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0782; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0781; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0780; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0779; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0778; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0777; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0776; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0775; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0774; // 0x730(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0773; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0772; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0771; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0770; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0769; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0768; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0767; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0766; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0765; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0764; // 0x780(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0763; // 0x788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0762; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0761; // 0x798(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0760; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0759; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0758; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0757; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0756; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0755; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0754; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0753; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0752; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0751; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0750; // 0x7f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0749; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0748; // 0x800(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0747; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0746; // 0x810(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0745; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0744; // 0x820(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0743; // 0x828(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0742; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0741; // 0x838(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0740; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0739; // 0x848(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0738; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0737; // 0x858(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0736; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0735; // 0x868(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0734; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0733; // 0x878(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0732; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0731; // 0x888(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0730; // 0x890(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0729; // 0x898(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0728; // 0x8a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0727; // 0x8a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0726; // 0x8b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0725; // 0x8b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0724; // 0x8c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0723; // 0x8c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0722; // 0x8d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0721; // 0x8d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0720; // 0x8e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0719; // 0x8e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0718; // 0x8f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0717; // 0x8f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0716; // 0x900(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0715; // 0x908(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0714; // 0x910(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0713; // 0x918(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0712; // 0x920(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0711; // 0x928(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0710; // 0x930(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0709; // 0x938(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0708; // 0x940(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0707; // 0x948(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0706; // 0x950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0705; // 0x958(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0704; // 0x960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0703; // 0x968(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0702; // 0x970(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0701; // 0x978(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0700; // 0x980(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0699; // 0x988(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0698; // 0x990(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0697; // 0x998(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0696; // 0x9a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0695; // 0x9a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0694; // 0x9b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0693; // 0x9b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0692; // 0x9c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0691; // 0x9c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0690; // 0x9d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0689; // 0x9d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0688; // 0x9e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0687; // 0x9e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0686; // 0x9f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0685; // 0x9f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0684; // 0xa00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0683; // 0xa08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0682; // 0xa10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0681; // 0xa18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0680; // 0xa20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0679; // 0xa28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0678; // 0xa30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0677; // 0xa38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0676; // 0xa40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0675; // 0xa48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0674; // 0xa50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0673; // 0xa58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0672; // 0xa60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0671; // 0xa68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0670; // 0xa70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0669; // 0xa78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0668; // 0xa80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0667; // 0xa88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0666; // 0xa90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0665; // 0xa98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0664; // 0xaa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0663; // 0xaa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0662; // 0xab0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0661; // 0xab8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0660; // 0xac0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0659; // 0xac8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0658; // 0xad0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0657; // 0xad8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0656; // 0xae0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0655; // 0xae8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0654; // 0xaf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0653; // 0xaf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0652; // 0xb00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0651; // 0xb08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0650; // 0xb10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0649; // 0xb18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0648; // 0xb20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0647; // 0xb28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0646; // 0xb30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0645; // 0xb38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0644; // 0xb40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0643; // 0xb48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0642; // 0xb50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0641; // 0xb58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0640; // 0xb60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0639; // 0xb68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0638; // 0xb70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0637; // 0xb78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0636; // 0xb80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0635; // 0xb88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0634; // 0xb90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0633; // 0xb98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0632; // 0xba0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0631; // 0xba8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0630; // 0xbb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0629; // 0xbb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0628; // 0xbc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0627; // 0xbc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0626; // 0xbd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0625; // 0xbd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0624; // 0xbe0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0623; // 0xbe8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0622; // 0xbf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0621; // 0xbf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0620; // 0xc00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0619; // 0xc08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0618; // 0xc10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0617; // 0xc18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0616; // 0xc20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0615; // 0xc28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0614; // 0xc30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0613; // 0xc38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0612; // 0xc40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0611; // 0xc48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0610; // 0xc50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0609; // 0xc58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0608; // 0xc60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0607; // 0xc68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0606; // 0xc70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0605; // 0xc78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0604; // 0xc80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0603; // 0xc88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0602; // 0xc90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0601; // 0xc98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0600; // 0xca0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0599; // 0xca8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0598; // 0xcb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0597; // 0xcb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0596; // 0xcc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0595; // 0xcc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0594; // 0xcd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0593; // 0xcd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0592; // 0xce0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0591; // 0xce8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0590; // 0xcf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0589; // 0xcf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0588; // 0xd00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0587; // 0xd08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0586; // 0xd10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0585; // 0xd18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0584; // 0xd20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0583; // 0xd28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0581; // 0xd30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0580; // 0xd38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0579; // 0xd40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0578; // 0xd48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0577; // 0xd50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0576; // 0xd58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0575; // 0xd60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0574; // 0xd68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0573; // 0xd70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0572; // 0xd78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0571; // 0xd80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0570; // 0xd88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0569; // 0xd90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0568; // 0xd98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0567; // 0xda0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0566; // 0xda8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0565; // 0xdb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0564; // 0xdb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0562; // 0xdc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0561; // 0xdc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0560; // 0xdd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0559; // 0xdd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0558; // 0xde0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0557; // 0xde8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0555; // 0xdf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0554; // 0xdf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0553; // 0xe00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0552; // 0xe08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0551; // 0xe10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0550; // 0xe18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0549; // 0xe20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0548; // 0xe28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0547; // 0xe30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0546; // 0xe38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0545; // 0xe40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0544; // 0xe48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0543; // 0xe50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0542; // 0xe58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0541; // 0xe60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0540; // 0xe68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0539; // 0xe70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0538; // 0xe78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0537; // 0xe80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0536; // 0xe88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0535; // 0xe90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0534; // 0xe98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0533; // 0xea0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0532; // 0xea8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0531; // 0xeb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0530; // 0xeb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0529; // 0xec0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0528; // 0xec8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0527; // 0xed0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0526; // 0xed8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0525; // 0xee0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0524; // 0xee8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0523; // 0xef0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0522; // 0xef8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0521; // 0xf00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0520; // 0xf08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0519; // 0xf10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0518; // 0xf18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0517; // 0xf20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0516; // 0xf28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0515; // 0xf30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0514; // 0xf38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0513; // 0xf40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0512; // 0xf48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0511; // 0xf50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0510; // 0xf58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0509; // 0xf60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0508; // 0xf68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0507; // 0xf70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0506; // 0xf78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0505; // 0xf80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0504; // 0xf88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0503; // 0xf90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0502; // 0xf98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0501; // 0xfa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0500; // 0xfa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0499; // 0xfb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0498; // 0xfb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0497; // 0xfc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0496; // 0xfc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0495; // 0xfd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0494; // 0xfd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0493; // 0xfe0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0492; // 0xfe8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0491; // 0xff0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0490; // 0xff8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0489; // 0x1000(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0488; // 0x1008(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0487; // 0x1010(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0486; // 0x1018(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0485; // 0x1020(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0484; // 0x1028(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0482; // 0x1030(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0481; // 0x1038(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0480; // 0x1040(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0479; // 0x1048(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0478; // 0x1050(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0477; // 0x1058(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0476; // 0x1060(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0475; // 0x1068(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0474; // 0x1070(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0473; // 0x1078(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0472; // 0x1080(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0471; // 0x1088(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0470; // 0x1090(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0469; // 0x1098(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0468; // 0x10a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0467; // 0x10a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0466; // 0x10b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0465; // 0x10b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0464; // 0x10c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0463; // 0x10c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0462; // 0x10d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0461; // 0x10d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0460; // 0x10e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0459; // 0x10e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0458; // 0x10f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0457; // 0x10f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0456; // 0x1100(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0455; // 0x1108(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0454; // 0x1110(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0453; // 0x1118(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0452; // 0x1120(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0451; // 0x1128(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0450; // 0x1130(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0449; // 0x1138(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0448; // 0x1140(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0447; // 0x1148(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0446; // 0x1150(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0445; // 0x1158(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0444; // 0x1160(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0443; // 0x1168(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0442; // 0x1170(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0441; // 0x1178(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0440; // 0x1180(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0439; // 0x1188(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0438; // 0x1190(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0437; // 0x1198(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0436; // 0x11a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0435; // 0x11a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0434; // 0x11b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0433; // 0x11b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0432; // 0x11c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0431; // 0x11c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0430; // 0x11d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0429; // 0x11d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0428; // 0x11e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0427; // 0x11e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0426; // 0x11f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0425; // 0x11f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0424; // 0x1200(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0423; // 0x1208(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0422; // 0x1210(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0421; // 0x1218(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0420; // 0x1220(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0419; // 0x1228(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0418; // 0x1230(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0417; // 0x1238(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0416; // 0x1240(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0415; // 0x1248(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0414; // 0x1250(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0413; // 0x1258(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0412; // 0x1260(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0411; // 0x1268(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0410; // 0x1270(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0409; // 0x1278(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0407; // 0x1280(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0408; // 0x1288(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0406; // 0x1290(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0405; // 0x1298(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0404; // 0x12a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0403; // 0x12a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0397; // 0x12b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0396; // 0x12b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0395; // 0x12c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0394; // 0x12c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0393; // 0x12d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0392; // 0x12d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0391; // 0x12e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0390; // 0x12e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0389; // 0x12f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0388; // 0x12f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0387; // 0x1300(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0386; // 0x1308(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0385; // 0x1310(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0384; // 0x1318(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0383; // 0x1320(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0382; // 0x1328(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0381; // 0x1330(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0380; // 0x1338(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0379; // 0x1340(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0378; // 0x1348(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0377; // 0x1350(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0376; // 0x1358(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0375; // 0x1360(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0374; // 0x1368(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0373; // 0x1370(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0372; // 0x1378(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0371; // 0x1380(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0369; // 0x1388(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0368; // 0x1390(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0367; // 0x1398(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0366; // 0x13a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0365; // 0x13a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0364; // 0x13b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0363; // 0x13b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0362; // 0x13c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0361; // 0x13c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0360; // 0x13d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0359; // 0x13d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0358; // 0x13e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0357; // 0x13e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0356; // 0x13f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0355; // 0x13f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0354; // 0x1400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0353; // 0x1408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0352; // 0x1410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0351; // 0x1418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0350; // 0x1420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0349; // 0x1428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0348; // 0x1430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0347; // 0x1438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0346; // 0x1440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0345; // 0x1448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0344; // 0x1450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0343; // 0x1458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0342; // 0x1460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0341; // 0x1468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0340; // 0x1470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0339; // 0x1478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0338; // 0x1480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0337; // 0x1488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0336; // 0x1490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0335; // 0x1498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0334; // 0x14a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0333; // 0x14a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0332; // 0x14b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0331; // 0x14b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0330; // 0x14c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0329; // 0x14c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0328; // 0x14d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0327; // 0x14d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0326; // 0x14e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0325; // 0x14e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0324; // 0x14f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0323; // 0x14f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0322; // 0x1500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0321; // 0x1508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0320; // 0x1510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0319; // 0x1518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0318; // 0x1520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0317; // 0x1528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0316; // 0x1530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0315; // 0x1538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0314; // 0x1540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0313; // 0x1548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0312; // 0x1550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0311; // 0x1558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0310; // 0x1560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0309; // 0x1568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0308; // 0x1570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0307; // 0x1578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0306; // 0x1580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0305; // 0x1588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0304; // 0x1590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0303; // 0x1598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0302; // 0x15a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0301; // 0x15a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0300; // 0x15b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0299; // 0x15b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0298; // 0x15c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0297; // 0x15c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0296; // 0x15d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0295; // 0x15d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0294; // 0x15e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0293; // 0x15e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0292; // 0x15f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0291; // 0x15f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0290; // 0x1600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0289; // 0x1608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0288; // 0x1610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0287; // 0x1618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0286; // 0x1620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0285; // 0x1628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0284; // 0x1630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0283; // 0x1638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0282; // 0x1640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0281; // 0x1648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0278; // 0x1650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0277; // 0x1658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0276; // 0x1660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0275; // 0x1668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0274; // 0x1670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0273; // 0x1678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0272; // 0x1680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0271; // 0x1688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0270; // 0x1690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0269; // 0x1698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0268; // 0x16a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0267; // 0x16a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0266; // 0x16b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0265; // 0x16b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0264; // 0x16c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0263; // 0x16c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0262; // 0x16d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0261; // 0x16d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0260; // 0x16e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0259; // 0x16e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0258; // 0x16f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0257; // 0x16f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0256; // 0x1700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0255; // 0x1708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0254; // 0x1710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0253; // 0x1718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0252; // 0x1720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0251; // 0x1728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0250; // 0x1730(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0249; // 0x1738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0248; // 0x1740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0247; // 0x1748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0246; // 0x1750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0245; // 0x1758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0244; // 0x1760(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0243; // 0x1768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0242; // 0x1770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0241; // 0x1778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0240; // 0x1780(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0239; // 0x1788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0238; // 0x1790(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0237; // 0x1798(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0236; // 0x17a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0235; // 0x17a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0234; // 0x17b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0233; // 0x17b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0232; // 0x17c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0231; // 0x17c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0230; // 0x17d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0229; // 0x17d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0228; // 0x17e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0227; // 0x17e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0226; // 0x17f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0225; // 0x17f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0224; // 0x1800(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0223; // 0x1808(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0222; // 0x1810(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0221; // 0x1818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0220; // 0x1820(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0219; // 0x1828(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0218; // 0x1830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0217; // 0x1838(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0216; // 0x1840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0215; // 0x1848(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0214; // 0x1850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0213; // 0x1858(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0212; // 0x1860(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0211; // 0x1868(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0210; // 0x1870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0209; // 0x1878(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0208; // 0x1880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0207; // 0x1888(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0206; // 0x1890(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0205; // 0x1898(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0204; // 0x18a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0203; // 0x18a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0202; // 0x18b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0201; // 0x18b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0200; // 0x18c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0199; // 0x18c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0198; // 0x18d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0197; // 0x18d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0196; // 0x18e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0195; // 0x18e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0194; // 0x18f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0193; // 0x18f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0192; // 0x1900(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0191; // 0x1908(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0190; // 0x1910(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0189; // 0x1918(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0188; // 0x1920(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0185; // 0x1928(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0184; // 0x1930(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0183; // 0x1938(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0182; // 0x1940(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0178; // 0x1948(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0177; // 0x1950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0176; // 0x1958(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0175; // 0x1960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0172; // 0x1968(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0171; // 0x1970(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0168; // 0x1978(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0167; // 0x1980(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0164; // 0x1988(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0163; // 0x1990(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0162; // 0x1998(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0161; // 0x19a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0159; // 0x19a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0158; // 0x19b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0156; // 0x19b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0155; // 0x19c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0154; // 0x19c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0153; // 0x19d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0152; // 0x19d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0151; // 0x19e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0150; // 0x19e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0149; // 0x19f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0148; // 0x19f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0147; // 0x1a00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0146; // 0x1a08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0145; // 0x1a10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0144; // 0x1a18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0143; // 0x1a20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0142; // 0x1a28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0141; // 0x1a30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0140; // 0x1a38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0139; // 0x1a40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0138; // 0x1a48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0137; // 0x1a50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0136; // 0x1a58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0135; // 0x1a60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0134; // 0x1a68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0133; // 0x1a70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0129; // 0x1a78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0128; // 0x1a80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0127; // 0x1a88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0126; // 0x1a90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0125; // 0x1a98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0124; // 0x1aa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0123; // 0x1aa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0122; // 0x1ab0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0121; // 0x1ab8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0120; // 0x1ac0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0117; // 0x1ac8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0116; // 0x1ad0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0114; // 0x1ad8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0113; // 0x1ae0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0112; // 0x1ae8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0111; // 0x1af0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0110; // 0x1af8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0109; // 0x1b00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0108; // 0x1b08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0107; // 0x1b10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0106; // 0x1b18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0105; // 0x1b20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0104; // 0x1b28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0103; // 0x1b30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0102; // 0x1b38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0101; // 0x1b40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0100; // 0x1b48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent099; // 0x1b50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent098; // 0x1b58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent097; // 0x1b60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent096; // 0x1b68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent095; // 0x1b70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x1b78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0x1b80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0x1b88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0x1b90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent090; // 0x1b98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent089; // 0x1ba0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent088; // 0x1ba8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent087; // 0x1bb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0x1bb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0x1bc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0x1bc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0x1bd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0x1bd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent081; // 0x1be0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent080; // 0x1be8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent079; // 0x1bf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent078; // 0x1bf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent077; // 0x1c00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent076; // 0x1c08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent075; // 0x1c10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent074; // 0x1c18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent073; // 0x1c20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent072; // 0x1c28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent071; // 0x1c30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent070; // 0x1c38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0x1c40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent068; // 0x1c48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0x1c50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0x1c58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0x1c60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0x1c68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent063; // 0x1c70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent062; // 0x1c78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0x1c80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent060; // 0x1c88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0x1c90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0x1c98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0x1ca0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x1ca8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x1cb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0x1cb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0x1cc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0x1cc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x1cd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x1cd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x1ce0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x1ce8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x1cf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x1cf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x1d00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x1d08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x1d10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x1d18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x1d20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x1d28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x1d30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x1d38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x1d40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x1d48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x1d50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x1d58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x1d60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x1d68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x1d70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x1d78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x1d80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x1d88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x1d90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x1d98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x1da0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x1da8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x1db0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x1db8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x1dc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x1dc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x1dd0(0x08)
	struct UDecalComponent* NewDecalComponent; // 0x1dd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x1de0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x1de8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x1df0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x1df8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x1e00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x1e08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x1e10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x1e18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x1e20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x1e28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x1e30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x1e38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x1e40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x1e48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x1e50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x1e58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x1e60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x1e68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x1e70(0x08)
	struct USceneComponent* SharedRoot; // 0x1e78(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_tvn_ngs_shell_01_a.BP_sod_bld_tvn_ngs_shell_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

