// BlueprintGeneratedClass BP_sod_bld_gld_enc_shop_ext_dressing_01_a.BP_sod_bld_gld_enc_shop_ext_dressing_01_a_C
// Size: 0x578 (Inherited: 0x3c8)
struct ABP_sod_bld_gld_enc_shop_ext_dressing_01_a_C : AActor {
	struct UBoxComponent* Box; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x400(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent0; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x568(0x08)
	struct USceneComponent* SharedRoot; // 0x570(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_gld_enc_shop_ext_dressing_01_a.BP_sod_bld_gld_enc_shop_ext_dressing_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

