// BlueprintGeneratedClass BP_sod_bld_trn_shop_ext_01_a.BP_sod_bld_trn_shop_ext_01_a_C
// Size: 0x440 (Inherited: 0x3c8)
struct ABP_sod_bld_trn_shop_ext_01_a_C : AActor {
	struct UChildActorComponent* AudioSpace; // 0x3c8(0x08)
	struct UStaticMeshComponent* Rainblocker_12; // 0x3d0(0x08)
	struct UStaticMeshComponent* Rainblocker_11; // 0x3d8(0x08)
	struct UStaticMeshComponent* RainBlocker_09; // 0x3e0(0x08)
	struct UStaticMeshComponent* RainBlocker_08; // 0x3e8(0x08)
	struct UStaticMeshComponent* RainBlocker_07; // 0x3f0(0x08)
	struct UStaticMeshComponent* RainBlocker_06; // 0x3f8(0x08)
	struct UStaticMeshComponent* RainBlocker_05; // 0x400(0x08)
	struct UStaticMeshComponent* RainBlocker_04; // 0x408(0x08)
	struct UStaticMeshComponent* RainBlocker_03; // 0x410(0x08)
	struct UStaticMeshComponent* RainBlocker_02; // 0x418(0x08)
	struct UStaticMeshComponent* RainBlocker_01; // 0x420(0x08)
	struct UStaticMeshComponent* sod_bld_trn_shop_01_a; // 0x428(0x08)
	struct UStaticMeshComponent* sod_bld_trn_shop_shell_01_a; // 0x430(0x08)
	struct USceneComponent* SharedRoot; // 0x438(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_trn_shop_ext_01_a.BP_sod_bld_trn_shop_ext_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

