// BlueprintGeneratedClass BP_sod_bld_oos_int_dressing_01_a.BP_sod_bld_oos_int_dressing_01_a_C
// Size: 0xb50 (Inherited: 0x3c8)
struct ABP_sod_bld_oos_int_dressing_01_a_C : AActor {
	struct UBoxComponent* Box14; // 0x3c8(0x08)
	struct UBoxComponent* Box13; // 0x3d0(0x08)
	struct UBoxComponent* Box12; // 0x3d8(0x08)
	struct UBoxComponent* Box11; // 0x3e0(0x08)
	struct UBoxComponent* Box10; // 0x3e8(0x08)
	struct UBoxComponent* Box9; // 0x3f0(0x08)
	struct UBoxComponent* Box8; // 0x3f8(0x08)
	struct UBoxComponent* Box7; // 0x400(0x08)
	struct UBoxComponent* Box6; // 0x408(0x08)
	struct UBoxComponent* Box5; // 0x410(0x08)
	struct UBoxComponent* Box4; // 0x418(0x08)
	struct UBoxComponent* Box3; // 0x420(0x08)
	struct UBoxComponent* Box2; // 0x428(0x08)
	struct UBoxComponent* Box1; // 0x430(0x08)
	struct UBoxComponent* Box; // 0x438(0x08)
	struct UBoxComponent* Box_Collision; // 0x440(0x08)
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x448(0x08)
	struct UChildActorComponent* MagicBox; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0221; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0220; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0219; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0218; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0217; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0216; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0215; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0214; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0213; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0212; // 0x4a0(0x08)
	struct USkeletalMeshComponent* SkeletalMesh; // 0x4a8(0x08)
	struct USceneComponent* DefaultSceneRoot1; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0211; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0210; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0209; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0208; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0207; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0206; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0205; // 0x4e8(0x08)
	struct USkeletalMeshComponent* SkeletalMeshComponent01; // 0x4f0(0x08)
	struct USkeletalMeshComponent* SkeletalMeshComponent0; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0201; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0200; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0199; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0198; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0197; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0196; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0195; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0194; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0193; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0192; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0191; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0190; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0189; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0188; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0187; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0186; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0185; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0184; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0183; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0182; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0181; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0180; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0179; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0178; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0177; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0176; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0175; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0174; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0173; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0172; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0171; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0170; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0169; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0168; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0167; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0166; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0165; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0164; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0163; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0162; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0161; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0160; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0159; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0158; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0157; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0156; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0155; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0154; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0153; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0152; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0151; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0150; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0149; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0148; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0147; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0146; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0145; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0144; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0143; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0142; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0141; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0140; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0139; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0138; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0137; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0136; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0135; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0134; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0133; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0132; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0131; // 0x730(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0130; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0129; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0128; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0127; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0126; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0125; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0124; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0123; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0122; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0121; // 0x780(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0120; // 0x788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0119; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0118; // 0x798(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0117; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0116; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0115; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0114; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0113; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0112; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0111; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0110; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0109; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0108; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0107; // 0x7f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0106; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0105; // 0x800(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0104; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0103; // 0x810(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0102; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0101; // 0x820(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0100; // 0x828(0x08)
	struct UStaticMeshComponent* StaticMeshComponent099; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent098; // 0x838(0x08)
	struct UStaticMeshComponent* StaticMeshComponent097; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent096; // 0x848(0x08)
	struct UStaticMeshComponent* StaticMeshComponent095; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x858(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0x868(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent090; // 0x878(0x08)
	struct UStaticMeshComponent* StaticMeshComponent089; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent088; // 0x888(0x08)
	struct UStaticMeshComponent* StaticMeshComponent087; // 0x890(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0x898(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0x8a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0x8a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0x8b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0x8b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent081; // 0x8c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent080; // 0x8c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent079; // 0x8d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent078; // 0x8d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent077; // 0x8e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent076; // 0x8e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent075; // 0x8f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent074; // 0x8f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent073; // 0x900(0x08)
	struct UStaticMeshComponent* StaticMeshComponent072; // 0x908(0x08)
	struct UStaticMeshComponent* StaticMeshComponent071; // 0x910(0x08)
	struct UStaticMeshComponent* StaticMeshComponent070; // 0x918(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0x920(0x08)
	struct UStaticMeshComponent* StaticMeshComponent068; // 0x928(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0x930(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0x938(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0x940(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0x948(0x08)
	struct UStaticMeshComponent* StaticMeshComponent063; // 0x950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent062; // 0x958(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0x960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent060; // 0x968(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0x970(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0x978(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0x980(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x988(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x990(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0x998(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0x9a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent052; // 0x9a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x9b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x9b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x9c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x9c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x9d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x9d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x9e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x9e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x9f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x9f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0xa00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0xa08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0xa10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0xa18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0xa20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0xa28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0xa30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0xa38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0xa40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0xa48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0xa50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0xa58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0xa60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0xa68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0xa70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0xa78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0xa80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0xa88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0xa90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0xa98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0xaa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0xaa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0xab0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0xab8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0xac0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0xac8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0xad0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0xad8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0xae0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0xae8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0xaf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0xaf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0xb00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0xb08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0xb10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0xb18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0xb20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0xb28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0xb30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0xb38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0xb40(0x08)
	struct USceneComponent* SharedRoot; // 0xb48(0x08)

	void Set Magic Box Hidden(bool Is Hidden); // Function BP_sod_bld_oos_int_dressing_01_a.BP_sod_bld_oos_int_dressing_01_a_C.Set Magic Box Hidden // Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
	void UserConstructionScript(); // Function BP_sod_bld_oos_int_dressing_01_a.BP_sod_bld_oos_int_dressing_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

