// BlueprintGeneratedClass BP_sod_bld_sov_ext_dressing_01_a.BP_sod_bld_sov_ext_dressing_01_a_C
// Size: 0x6a8 (Inherited: 0x3c8)
struct ABP_sod_bld_sov_ext_dressing_01_a_C : AActor {
	struct UStaticMeshComponent* StaticMesh8; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x408(0x08)
	struct UStaticMeshComponent* shp_int_hook_01_a; // 0x410(0x08)
	struct UStaticMeshComponent* cap_candle_chandelier_candle_flames_01_a; // 0x418(0x08)
	struct UBoxComponent* Box; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0101; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0100; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent099; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent098; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent097; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent096; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent095; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent079; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent078; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent077; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent076; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent075; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent074; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent073; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent072; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent071; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent070; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent068; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x698(0x08)
	struct USceneComponent* SharedRoot; // 0x6a0(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_sov_ext_dressing_01_a.BP_sod_bld_sov_ext_dressing_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

