// BlueprintGeneratedClass BP_sod_bld_tvn_ngs_groundfloor_dressing_01_a.BP_sod_bld_tvn_ngs_groundfloor_dressing_01_a_C
// Size: 0xd90 (Inherited: 0x3c8)
struct ABP_sod_bld_tvn_ngs_groundfloor_dressing_01_a_C : AActor {
	struct UStaticMeshComponent* sod_bld_barrel_netting_01_a; // 0x3c8(0x08)
	struct USkeletalMeshComponent* gmp_musicbox_01_a; // 0x3d0(0x08)
	struct UChildActorComponent* TrinketMountPoints; // 0x3d8(0x08)
	struct UStaticMeshComponent* cmn_bolt_01_a; // 0x3e0(0x08)
	struct UChildActorComponent* BP_onboarding_intro_tavern_table; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x410(0x08)
	struct UStaticMeshComponent* cmn_shovel_02_a; // 0x418(0x08)
	struct UStaticMeshComponent* cmn_hat_01_a; // 0x420(0x08)
	struct UStaticMeshComponent* cmn_hook_10_a; // 0x428(0x08)
	struct UStaticMeshComponent* cmn_hat_18_a; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x438(0x08)
	struct UStaticMeshComponent* cmn_hat_05_a; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0322; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0321; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0320; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0319; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0318; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0317; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0316; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0315; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0314; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0313; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0312; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0310; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0308; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0307; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0306; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0305; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0304; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0303; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0302; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0301; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0300; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0299; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0298; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0297; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0296; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0294; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0293; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0292; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0291; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0290; // 0x540(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0289; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0288; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0285; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0284; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0283; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0282; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0281; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0280; // 0x580(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0279; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0278; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0277; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0276; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0275; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0274; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0273; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0272; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0271; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0270; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0269; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0267; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0266; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0265; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0264; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0263; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0262; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0261; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0260; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0259; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0258; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0257; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0256; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0255; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0254; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0253; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0252; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0251; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0250; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0249; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0248; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0245; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0243; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0242; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0241; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0240; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0239; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0238; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0237; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0235; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0234; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0233; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0232; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0231; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0230; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0226; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0225; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0224; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0215; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0214; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0213; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0212; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0211; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0210; // 0x730(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0209; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0208; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0207; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0206; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0205; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0204; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0203; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0202; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0201; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0200; // 0x780(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0199; // 0x788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0198; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0197; // 0x798(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0196; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0195; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0194; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0193; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0192; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0191; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0190; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0189; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0188; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0187; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0186; // 0x7f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0185; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0184; // 0x800(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0183; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0182; // 0x810(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0181; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0180; // 0x820(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0179; // 0x828(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0178; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0177; // 0x838(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0176; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0175; // 0x848(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0174; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0173; // 0x858(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0172; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0171; // 0x868(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0170; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0169; // 0x878(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0168; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0167; // 0x888(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0166; // 0x890(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0165; // 0x898(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0164; // 0x8a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0163; // 0x8a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0162; // 0x8b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0161; // 0x8b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0160; // 0x8c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0159; // 0x8c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0158; // 0x8d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0156; // 0x8d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0155; // 0x8e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0154; // 0x8e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0153; // 0x8f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0152; // 0x8f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0151; // 0x900(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0150; // 0x908(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0149; // 0x910(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0147; // 0x918(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0146; // 0x920(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0145; // 0x928(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0144; // 0x930(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0143; // 0x938(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0141; // 0x940(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0140; // 0x948(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0139; // 0x950(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0138; // 0x958(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0137; // 0x960(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0136; // 0x968(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0135; // 0x970(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0134; // 0x978(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0133; // 0x980(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0132; // 0x988(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0131; // 0x990(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0130; // 0x998(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0129; // 0x9a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0128; // 0x9a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0127; // 0x9b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0126; // 0x9b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0125; // 0x9c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0124; // 0x9c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0123; // 0x9d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0122; // 0x9d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0121; // 0x9e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0120; // 0x9e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0118; // 0x9f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0117; // 0x9f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0116; // 0xa00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0115; // 0xa08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0114; // 0xa10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0113; // 0xa18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0112; // 0xa20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0111; // 0xa28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0110; // 0xa30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0109; // 0xa38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0108; // 0xa40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0107; // 0xa48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0106; // 0xa50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0105; // 0xa58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0104; // 0xa60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0102; // 0xa68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0101; // 0xa70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0100; // 0xa78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent099; // 0xa80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent098; // 0xa88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent097; // 0xa90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent096; // 0xa98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent095; // 0xaa0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0xaa8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0xab0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0xab8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0xac0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent089; // 0xac8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent088; // 0xad0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent087; // 0xad8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0xae0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0xae8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0xaf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0xaf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0xb00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent081; // 0xb08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent080; // 0xb10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent079; // 0xb18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent078; // 0xb20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent077; // 0xb28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent076; // 0xb30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent075; // 0xb38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent074; // 0xb40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent073; // 0xb48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent072; // 0xb50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent071; // 0xb58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent070; // 0xb60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent069; // 0xb68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent068; // 0xb70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent067; // 0xb78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent066; // 0xb80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent065; // 0xb88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent064; // 0xb90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent063; // 0xb98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent062; // 0xba0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent061; // 0xba8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent060; // 0xbb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent059; // 0xbb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent058; // 0xbc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent057; // 0xbc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent056; // 0xbd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent055; // 0xbd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent054; // 0xbe0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent053; // 0xbe8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0xbf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0xbf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0xc00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0xc08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0xc10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0xc18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0xc20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0xc28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0xc30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0xc38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0xc40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent040; // 0xc48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0xc50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0xc58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0xc60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0xc68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0xc70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0xc78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0xc80(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0xc88(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0xc90(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0xc98(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0xca0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0xca8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0xcb0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0xcb8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0xcc0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0xcc8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0xcd0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0xcd8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0xce0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0xce8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0xcf0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0xcf8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0xd00(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0xd08(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0xd10(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0xd18(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0xd20(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0xd28(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0xd30(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0xd38(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0xd40(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0xd48(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0xd50(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0xd58(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0xd60(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0xd68(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0xd70(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0xd78(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0xd80(0x08)
	struct USceneComponent* SharedRoot; // 0xd88(0x08)

	void UserConstructionScript(); // Function BP_sod_bld_tvn_ngs_groundfloor_dressing_01_a.BP_sod_bld_tvn_ngs_groundfloor_dressing_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

