// BlueprintGeneratedClass bsp_flower_cluster_03_c.bsp_flower_cluster_03_c_C
// Size: 0x448 (Inherited: 0x408)
struct Absp_flower_cluster_03_c_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_pebbles_h_01; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_a_01; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock|_pebbles_g_01; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_f_01; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_flower_06_b_01; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_flower_05_b_01; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_flower_01_a_01; // 0x438(0x08)
	struct USceneComponent* SharedRoot; // 0x440(0x08)

	void UserConstructionScript(); // Function bsp_flower_cluster_03_c.bsp_flower_cluster_03_c_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1870810
};

