// BlueprintGeneratedClass bsp_flower_cluster_01_b.bsp_flower_cluster_01_b_C
// Size: 0x460 (Inherited: 0x408)
struct Absp_flower_cluster_01_b_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_xtra_small__b; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__e; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__b; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__d; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__c; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__d; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x450(0x08)
	struct USceneComponent* SharedRoot; // 0x458(0x08)

	void UserConstructionScript(); // Function bsp_flower_cluster_01_b.bsp_flower_cluster_01_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

