// BlueprintGeneratedClass bsp_plm_cluster_03_a.bsp_plm_cluster_03_a_C
// Size: 0x488 (Inherited: 0x408)
struct Absp_plm_cluster_03_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x448(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x478(0x08)
	struct USceneComponent* Scene; // 0x480(0x08)

	void UserConstructionScript(); // Function bsp_plm_cluster_03_a.bsp_plm_cluster_03_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

