// BlueprintGeneratedClass bsp_plm_cluster_03_b.bsp_plm_cluster_03_b_C
// Size: 0x470 (Inherited: 0x408)
struct Absp_plm_cluster_03_b_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_bush_03_a; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_d; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_c; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_b; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_e; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a_02; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_a_01; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_rock_cliff_j_01; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_a_02; // 0x448(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_tre_palm_02_a_01; // 0x458(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a_01; // 0x460(0x08)
	struct USceneComponent* Scene; // 0x468(0x08)

	void UserConstructionScript(); // Function bsp_plm_cluster_03_b.bsp_plm_cluster_03_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

