// BlueprintGeneratedClass bsp_bch_rocks_06.bsp_bch_rocks_06_C
// Size: 0x480 (Inherited: 0x408)
struct Absp_bch_rocks_06_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_pebbles__b4_1; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__c13_1; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__a14_1; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__g_1; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__b17_1; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__b14_1; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__h_1; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__d13_1; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e12_1; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__a17_1; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e11_1; // 0x458(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__d23_1; // 0x460(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__d10_1; // 0x468(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__e12_1; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x478(0x08)

	void UserConstructionScript(); // Function bsp_bch_rocks_06.bsp_bch_rocks_06_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x188c2f0
};

